
## :white_check_mark: Apply Succeeded

[CI link](https://github.com/yuta051214/aws-ecs-terraform/actions/runs/5124369652)



<pre><code>Apply complete! Resources: 4 added, 0 changed, 0 destroyed.</code></pre>

<details><summary>Details (Click me)</summary>

```hcl
Acquiring state lock. This may take a few moments...
module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-06656c5c3602f0f5d]
module.vpc.aws_default_security_group.this[0]: Refreshing state... [id=sg-0054216335c294644]
module.vpc.aws_default_route_table.default[0]: Refreshing state... [id=rtb-083a026f63d526c5d]
aws_security_group.ecs: Refreshing state... [id=sg-01ac9694e73ce7907]
module.vpc.aws_default_network_acl.this[0]: Refreshing state... [id=acl-0732e30fca26370d6]
module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-05bf2ce5441b4724d]
aws_security_group.alb: Refreshing state... [id=sg-05c7fc4678898ca54]
module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-0f745594c0f320817]
module.vpc.aws_route_table.private[1]: Refreshing state... [id=rtb-0fe40e4127bd7e683]
module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-087a561778d6e5a55]
module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-0667f822c116447c0]
module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-045aeb3b5dc72c33c]
module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-08601bb7dbcd97701]
module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-029491a8a902647c7]
module.vpc.aws_eip.nat[0]: Refreshing state... [id=eipalloc-0fb7fc86204155dce]
aws_security_group_rule.ecs_from_alb: Refreshing state... [id=sgrule-1805189038]
module.vpc.aws_eip.nat[1]: Refreshing state... [id=eipalloc-0a9f7eb7fcf5eb315]
module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-0a60610289f274ed7]
module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-020fb839e900f77d5]
module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-0d73844da0ac85ea8]
module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-060e5a31b77fe85c1]
module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-029491a8a902647c71080289494]
module.vpc.aws_nat_gateway.this[0]: Refreshing state... [id=nat-06a6592ae719519e0]
module.vpc.aws_nat_gateway.this[1]: Refreshing state... [id=nat-0f1336eac8f68336b]
module.vpc.aws_route.private_nat_gateway[1]: Refreshing state... [id=r-rtb-0fe40e4127bd7e6831080289494]
module.vpc.aws_route.private_nat_gateway[0]: Refreshing state... [id=r-rtb-0f745594c0f3208171080289494]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_lb.alb will be created
  + resource "aws_lb" "alb" {
      + arn                                         = (known after apply)
      + arn_suffix                                  = (known after apply)
      + desync_mitigation_mode                      = "defensive"
      + dns_name                                    = (known after apply)
      + drop_invalid_header_fields                  = false
      + enable_deletion_protection                  = false
      + enable_http2                                = true
      + enable_tls_version_and_cipher_suite_headers = false
      + enable_waf_fail_open                        = false
      + enable_xff_client_port                      = false
      + id                                          = (known after apply)
      + idle_timeout                                = 60
      + internal                                    = (known after apply)
      + ip_address_type                             = (known after apply)
      + load_balancer_type                          = "application"
      + name                                        = "go-simple-server-alb"
      + preserve_host_header                        = false
      + security_groups                             = [
          + "sg-05c7fc4678898ca54",
        ]
      + subnets                                     = [
          + "subnet-05bf2ce5441b4724d",
          + "subnet-08601bb7dbcd97701",
        ]
      + tags_all                                    = (known after apply)
      + vpc_id                                      = (known after apply)
      + xff_header_processing_mode                  = "append"
      + zone_id                                     = (known after apply)
    }

  # aws_lb_listener.alb_listener will be created
  + resource "aws_lb_listener" "alb_listener" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + load_balancer_arn = (known after apply)
      + port              = 80
      + protocol          = "HTTP"
      + ssl_policy        = (known after apply)
      + tags_all          = (known after apply)

      + default_action {
          + order = (known after apply)
          + type  = "fixed-response"

          + fixed_response {
              + content_type = "text/plain"
              + message_body = "Fixed response content"
              + status_code  = "200"
            }
        }
    }

  # aws_lb_listener_rule.alb_listener_rule will be created
  + resource "aws_lb_listener_rule" "alb_listener_rule" {
      + arn          = (known after apply)
      + id           = (known after apply)
      + listener_arn = (known after apply)
      + priority     = (known after apply)
      + tags_all     = (known after apply)

      + action {
          + order            = (known after apply)
          + target_group_arn = (known after apply)
          + type             = "forward"
        }

      + condition {
          + path_pattern {
              + values = [
                  + "*",
                ]
            }
        }
    }

  # aws_lb_target_group.target_group will be created
  + resource "aws_lb_target_group" "target_group" {
      + arn                                = (known after apply)
      + arn_suffix                         = (known after apply)
      + connection_termination             = false
      + deregistration_delay               = "300"
      + id                                 = (known after apply)
      + ip_address_type                    = (known after apply)
      + lambda_multi_value_headers_enabled = false
      + load_balancing_algorithm_type      = (known after apply)
      + load_balancing_cross_zone_enabled  = (known after apply)
      + name                               = "go-simple-server-target-group"
      + port                               = 8080
      + preserve_client_ip                 = (known after apply)
      + protocol                           = "HTTP"
      + protocol_version                   = (known after apply)
      + proxy_protocol_v2                  = false
      + slow_start                         = 0
      + tags_all                           = (known after apply)
      + target_type                        = "ip"
      + vpc_id                             = "vpc-06656c5c3602f0f5d"

      + health_check {
          + enabled             = true
          + healthy_threshold   = 3
          + interval            = 30
          + matcher             = (known after apply)
          + path                = "/health_checks"
          + port                = "traffic-port"
          + protocol            = "HTTP"
          + timeout             = 5
          + unhealthy_threshold = 3
        }
    }

Plan: 4 to add, 0 to change, 0 to destroy.
aws_lb_target_group.target_group: Creating...
aws_lb.alb: Creating...
aws_lb_target_group.target_group: Creation complete after 3s [id=arn:aws:elasticloadbalancing:ap-northeast-1:847208500766:targetgroup/go-simple-server-target-group/29ad26420bbc504c]
aws_lb.alb: Still creating... [10s elapsed]
aws_lb.alb: Still creating... [20s elapsed]
aws_lb.alb: Still creating... [30s elapsed]
aws_lb.alb: Still creating... [40s elapsed]
aws_lb.alb: Still creating... [50s elapsed]
aws_lb.alb: Still creating... [1m0s elapsed]
aws_lb.alb: Still creating... [1m10s elapsed]
aws_lb.alb: Still creating... [1m20s elapsed]
aws_lb.alb: Still creating... [1m30s elapsed]
aws_lb.alb: Still creating... [1m40s elapsed]
aws_lb.alb: Still creating... [1m50s elapsed]
aws_lb.alb: Still creating... [2m0s elapsed]
aws_lb.alb: Creation complete after 2m4s [id=arn:aws:elasticloadbalancing:ap-northeast-1:847208500766:loadbalancer/app/go-simple-server-alb/aede6b28620276fb]
aws_lb_listener.alb_listener: Creating...
aws_lb_listener.alb_listener: Creation complete after 1s [id=arn:aws:elasticloadbalancing:ap-northeast-1:847208500766:listener/app/go-simple-server-alb/aede6b28620276fb/2167cfbbd8a69453]
aws_lb_listener_rule.alb_listener_rule: Creating...
aws_lb_listener_rule.alb_listener_rule: Creation complete after 0s [id=arn:aws:elasticloadbalancing:ap-northeast-1:847208500766:listener-rule/app/go-simple-server-alb/aede6b28620276fb/2167cfbbd8a69453/a9993953bdf6aa70]
Releasing state lock. This may take a few moments...

Apply complete! Resources: 4 added, 0 changed, 0 destroyed.

```

</details>

<!-- github-comment: {"Command":"apply","JobName":"terraform","PRNumber":4,"Program":"tfcmt","SHA1":"1e443ebf82147b8036e5a513709e1ef372172204","Vars":{},"WorkflowName":"Terraform"} -->